KB = """
知识库：
1.孝道观念分为相互性孝道和权威性孝道，相互性孝道的运作基础是遵循孝道规范是为了回报父母的养育恩情以及满足自然而生的情感互动需要, 
表现为自发性的关心和关照父母。权威性孝道的运作基础则是通过对角色规范和等级制度的遵从来寻求社会认同, 表现为压抑自己顺从父母和维护家庭荣誉。
当亲子间相互性孝道或权威性孝道不存在冲突时, 孝道观念的水平并不影响子女抑郁; 
当亲子孝道观念存在冲突时, 在父−子相互性孝道、父−女及母−女相互性和权威性孝道上均表现出当父母孝道水平高于子女时,
与父母低于子女相比,子女的抑郁水平更高;
此外, 在父−子、父−女、母−女组合中均表现出当亲子间权威性 孝道的冲突程度越高时,子女的抑郁水平越高,
而在母−女组合中还表现出当亲子间相互性孝道的冲突程度越高时,女儿的抑郁水平越高。

2.逆境观念分为积极的与消极的：
关于逆境的积极文化信念：植根于儒家思想，具有毅力和容忍等内在力量与美德，存在强调逆境积极价值和人们战胜逆境能力的文化信念。
关于逆境的消极文化信念：另一方面，在佛教和道教影响下，迷信和强调宿命是中国传统文化的内在特征。因此，也存在强调人们无法战胜逆境（如宿命）以及逆境负面影响的文化信念。
处于严苛且缺乏养育的环境（例如家庭社会经济劣势）会加剧那些对逆境持负面文化信念的中国青少年出现⼼理问题的风险；
而在负面的家庭环境中，对逆境持积极⽂化信念可以缓解中国青少年内化问题和外化问题的风险。

3.家庭经济压力与青少年抑郁呈显著正相关。
歧视知觉是指个体知觉到由于自己所属团体成员身份（如种族、贫困等）而受到有区别或不公正的对待。
与年幼儿童相比，经济压力较大的青少年所感知到的歧视较为明显且危害尤为严重。
家庭经济压力对歧视知觉具有正向预测作用，歧视与家庭经济压力均与子女心理问题正相关。歧视很可能会危害青少年自尊自信，进而导致社交能力减弱。
对于亲子依恋水平较低的青少年，家庭经济压力对抑郁的影响是通过歧视知觉这一中介变量来实现的。相比之下，对于亲子依恋水平较高的青少年，经济压力通过歧视知觉对抑郁的中介效应不显著。

4.父母教育卷入是指父母自身对孩子教育理念和发展的期望，在家庭和学校中，为促使孩子取得更好学业成就和心理发展所做出的多种教育参与行为的总和。
人生意义感是指个体对其当下所拥有的生命意念和价值的感知，以及对未来生活意义的目标的追寻。
个体经历较多拒绝、排斥和冲突的人际交往经历尤其是亲子关系, 会形成消极的认知图式和自我评价, 从而导致更高水平的抑郁风险。
温暖的亲子关系可以作为面临压力时的一种保护因素减少其消极影响。
相比低亲子关系−低教育卷入一致的个体, 高亲子关系−高教育卷入的青少年有着更低水平的挫败感, 且相比于低亲子关系−高教育卷入的青少年, 有着高亲子关系−低教育卷入的个体表现出更低水平的挫败感。
挫败感在亲子关系−教育卷入与青少年抑郁、自伤和自杀意念之间起部分中介作用。
人生意义感可以改善个体健康水平, 在面对逆境时, 个体可以通过追求生活的目标感来减少消极影响, 进而降低心理障碍的发生风险。人生意义感可以减少挫败感对青少年抑郁、自伤和自杀意念的正向作用。

5.家庭教养方式分为三类：苛求型、过度保护型、理性民主型
苛求型的父母可能会给孩子过大的压力，导致大学生出现焦虑、自卑等心理问题。而过度保
护孩子则可能使其缺乏独立性和自主性，影响大学生的自我认知和情绪管理能力。
相比之下，理性、民主的教养方式更有助于大学生建立积极的自我认知，提高情绪管理能力，促进他们的身心健康发展。
粗暴养育作为一种消极的养育行为，是指父母采用身体攻击、言语攻击等粗暴的教养方式教育犯错子女的教养行为。
粗暴养育、心理僵化、心理困扰两两之间均呈显著正相关。父母粗暴养育不仅能够直接正向预测青少年心理困扰，而且能够通过心理僵化的中介作用间接预测青少年心理困扰。

6.父母间冲突会损害家庭功能，进而加剧青少年抑郁的风险。
积极的逆境文化信念在缓冲父母间冲突对青少年抑郁危害方面具有保护作用。
对于持有消极逆境文化信念的青少年而言，较高水平的父母冲突家庭消极功能与更多的抑郁症状相关。
对于持有积极逆境文化信念的青少年，父母冲突家庭消极功能与抑郁症状之间不存在关联。
只有在持有消极逆境文化信念的青少年中，家庭功能才与抑郁症状呈负相关。
"""
